# Универсальные строки
point_on_user = "Пингани пользователя, чей это персонаж, укажи его ник или id."
forbidden_chars = "Тут какие-то недопустимые символы. Может, не надо никакой кириллицы или точек?"

# Гейм-мастерские команды
# Регистрация
gm_reg_char_error = "Имя персонажа длиннее 15 символов. Не надо так много. Отмена."
gm_reg_password_error = "Пароль длинее 15 символов. Куда вам столько? Отмена регистрации."
gm_reg_wiki_error = "Ссылка на вики слишком большая. Этого вообще быть не должно, напишите администрации."

# Интерактивная регистрация
gm_int_reg_char_tooltip = "Напиши имя регистрируемого персонажа. Разумеется, на латинице."
gm_int_reg_char_error = "Имя персонажа длиннее 15 символов или содержит не ASCII символы. Попробуй еще раз."
gm_int_reg_pass_tooltip = "Напишите пароль. Не надо делать его **слишком** странным."
gm_int_reg_pass_error = "Пароль длиннее 15 символов или содержит не ASCII символы. Попробуйте еще раз."

gm_int_reg_user_error = "Не могу найти такого пользователя. Вбей его имя еще раз."
gm_int_reg_wiki_tooltip = "Напиши ссылку на вики этого персонажа."
gm_int_reg_wiki_error = "Это не ссылка на вики. Не надо так. Напиши ссылку раз."

# Интерактивные команды

gm_int_ban_what_tooltip = "Напиши слово \"игрока\" или \"персонажа\", чтобы я понял, кого ты хочешь забанить."
gm_int_unban_what_tooltip = "Напиши слово \"игрока\" или \"персонажа\", чтобы я понял, кого ты хочешь забанить."
gm_int_del_what_tooltip = "Напиши слово \"игрока\" или \"персонажа\", чтобы я понял, кого ты хочешь удалить."
gm_int_check_what_tooltip = "Напиши слово \"игрока\" или \"персонажа\", чтобы я понял, кого ты хочешь проверить."

gm_int_what_error = "Напиши \"игрока\" или \"персонажа\", а не то, что ты написал вторым словом. "
gm_int_char_tooltip = "Напиши имя этого персонажа."
gm_int_char_error = "Не могу найти этого персонажа. Напиши его имя еще раз."
gm_int_user_tooltip = "Пингани этого игрока, напиши его id или юзернейм"
gm_int_user_error = "Не могу найти этого игрока. Напиши его имя еще раз."

# Команды игроков
# Подтверждение возраста

plr_age_confirmation_tip = 'Для игры на нашем сервере вам надо подтвердить возраст. На нашем сервере разрешено играть ' \
                           'только совершеннолетним людям (т.е. достигшим возраста 18 лет). Мы относимся к этому ' \
                           'серьезно, поэтому сейчас не лучшее время для упражнений в юморе. Напишите "Подтверждаю, ' \
                           'что мне исполнилось 18 лет и я совершеннолетний", чтобы подтвердить возраст. Если вы не ' \
                           'подтвердите возраст, вы не можете играть на сервере, а так же, скорее всего, ' \
                           'находиться на этом дискорд-сервере. '
plr_age_confirmation_already = "Возраст уже подтвержден. Если вы растете в обратную сторону, свяжитесь с " \
                               "администрацией и, возможно, докторами."
plr_age_confirmation_error = "Ты написал что-то еще. Попробуй еще раз. Учти, что команда работает только раз в " \
                             "день."

# Интерактивная команда скинов

plr_skin_general_tooltip = 'Напишите, что вы хотите сделать со скином. Можно написать "залить" или "получить" ' \
                           'или "вывести" или "получитьвсе" или "уничтожить".'
plr_skin_general_error = "Очень смешно. Это не то, что я могу понять. Напиши нормально."
plr_skin_char_tooltip = "Напиши имя персонажа, чей скин ты хочешь залить."
plr_skin_char_error = "У тебя нет такого персонажа или он забанен. Попробуй написать правильно или напиши \"Отмена\"."
plr_skin_postfix_tooltip = 'Укажите постфикс. Если напишете "null", то будет считаться, что постфикса нет. Сам ' \
                           "постфикс может содержать кириллические символы."
plr_skin_att_tooltip = "Залейте скин следующим сообщением."
plr_skin_att_error = "Ты не приложил аттачментов. Давай еще раз."
plr_skin_delete_all_tooltip = "Напиши полное имя скина, которое ты хочешь удалить."

plr_skin_link_or_del_tooltip = "Вбей полное название скина (с постфиксом, если он есть). Расширение указывать не нужно."
plr_skin_get_all_tooltip = "Напиши имя персонажа, чьи скины ты хочешь вывести."
plr_skin_get_all_error = "У тебя нет такого персонажа или он в бане. Попробуй написать правильно или напиши \"Отмена\"."
plr_skin_list_tooltip = "Напиши имя персонажа, названия чьих скинов ты хочешь узнать."
plr_skin_list_error = "У тебя нет такого персонажа или он забанен. Попробуй написать правильно или напиши \"Отмена\"."

# Команды вики
wiki_user_tooltip = "Укажите имя пользователя."
wiki_password_tooltip = "Укажите пароль."
wiki_reason_tooltip = "Укажите причину."
wiki_registration_tooltip = "Пингани пользователя, чей это аккаунт, укажи его ник или id."
wiki_registration_error = "Не могу найти такого пользователя. Вбей его имя еще раз."
wiki_check_tooltip = "Напиши слово \"аккаунта\" или \"игрока\", чтобы я понял, кого ты хочешь проверить."
wiki_check_error = "Не понял, что ты хочешь. Напиши \"аккаунта\" или \"игрока\", чтобы я понял, что ты хочешь " \
                   "проверить."

# Команды персонажа

stats_char_tooltip = "Напиши имя персонажа."
stats_category_tooltip = "Введите категорию изменяемой характеристики. Варианты: атрибут, навык, поток, усилие, особое."
stats_category_error = "Это не похоже на категорию. Попробуйте еще раз."
stats_name_tooltip = "Введите название изменяемой характеристики."
stats_name_error = "Это не похоже на валидное название хар-ки. Попробуйте еще раз."
stats_mod_tooltip = 'Введите модификатор. Можно писать как "+1", так и "-1" для вычислений, ' \
                    'а можно просто число для того, чтобы установить характеристику на него.'
stats_mod_error = "Это не похоже на число. Попробуйте еще раз."
